#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iot_certificate.cert will be created
  + resource "aws_iot_certificate" "cert" {
      + active          = true
      + arn             = (known after apply)
      + certificate_pem = (sensitive value)
      + id              = (known after apply)
      + private_key     = (sensitive value)
      + public_key      = (sensitive value)
    }

  # aws_iot_policy.publish will be created
  + resource "aws_iot_policy" "publish" {
      + arn                = (known after apply)
      + default_version_id = (known after apply)
      + id                 = (known after apply)
      + name               = "publish-policy"
      + policy             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iot:Connect",
                          + "iot:Publish",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iot_policy_attachment.publish_to_cert will be created
  + resource "aws_iot_policy_attachment" "publish_to_cert" {
      + id     = (known after apply)
      + policy = "publish-policy"
      + target = (known after apply)
    }

  # aws_iot_thing.this[0] will be created
  + resource "aws_iot_thing" "this" {
      + arn               = (known after apply)
      + default_client_id = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + version           = (known after apply)
    }

  # aws_iot_thing_principal_attachment.this_to_cert[0] will be created
  + resource "aws_iot_thing_principal_attachment" "this_to_cert" {
      + id        = (known after apply)
      + principal = (known after apply)
      + thing     = (known after apply)
    }

  # random_string.thing_name[0] will be created
  + resource "random_string" "thing_name" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `terraform github actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `deployments/terraform`, Workspace: `default`*
